/*
MySQL Backup
Source Server Version: 5.7.17
Source Database: myerp
Date: 2020/9/17 10:00:29
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
--  Table structure for `tbdealer`
-- ----------------------------
DROP TABLE IF EXISTS `tbdealer`;
CREATE TABLE `tbdealer` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `companyname` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `tel` varchar(255) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `memo` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `tbguestbook`
-- ----------------------------
DROP TABLE IF EXISTS `tbguestbook`;
CREATE TABLE `tbguestbook` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(255) DEFAULT NULL,
  `tel` varchar(255) DEFAULT NULL,
  `contents` varchar(255) DEFAULT NULL,
  `createtime` varchar(255) DEFAULT NULL,
  `isshow` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `tbinout`
-- ----------------------------
DROP TABLE IF EXISTS `tbinout`;
CREATE TABLE `tbinout` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `opttype` int(11) DEFAULT NULL COMMENT '-1为出库，1为入库',
  `proid` int(11) DEFAULT NULL,
  `pronum` varchar(255) DEFAULT NULL,
  `proname` varchar(50) DEFAULT NULL,
  `protype` varchar(255) DEFAULT NULL,
  `proimgurl` varchar(300) DEFAULT NULL,
  `prooldnum` int(11) DEFAULT NULL,
  `proaddnum` int(11) DEFAULT NULL COMMENT '入库或者出库的数量',
  `unitname` varchar(255) DEFAULT NULL COMMENT '计量单位名称',
  `ctime` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=71 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `tblog`
-- ----------------------------
DROP TABLE IF EXISTS `tblog`;
CREATE TABLE `tblog` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `typeid` int(11) DEFAULT NULL,
  `userid` int(11) DEFAULT NULL,
  `username` varchar(255) DEFAULT NULL,
  `msg` varchar(255) DEFAULT NULL,
  `ctime` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=43 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `tbmenubar`
-- ----------------------------
DROP TABLE IF EXISTS `tbmenubar`;
CREATE TABLE `tbmenubar` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `MenuName` varchar(100) DEFAULT NULL,
  `ParentID` int(11) DEFAULT NULL,
  `depth` int(11) DEFAULT NULL,
  `ParentPath` varchar(100) DEFAULT NULL,
  `Href` varchar(100) DEFAULT NULL,
  `Target` varchar(100) DEFAULT NULL,
  `OrderList` int(11) DEFAULT NULL,
  `Visible` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=36 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `tbnews`
-- ----------------------------
DROP TABLE IF EXISTS `tbnews`;
CREATE TABLE `tbnews` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(100) DEFAULT NULL,
  `author` varchar(100) DEFAULT NULL,
  `contents` text,
  `createtime` varchar(100) DEFAULT NULL,
  `typeid` varchar(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `tborderhead`
-- ----------------------------
DROP TABLE IF EXISTS `tborderhead`;
CREATE TABLE `tborderhead` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `orderid` varchar(255) DEFAULT NULL,
  `sname` varchar(255) DEFAULT NULL,
  `stel` varchar(255) DEFAULT NULL,
  `saddress` varchar(255) DEFAULT NULL,
  `sumprice` decimal(11,0) DEFAULT '0',
  `memberid` int(11) DEFAULT NULL,
  `ctime` varchar(255) DEFAULT NULL,
  `ptime` varchar(255) DEFAULT NULL,
  `memo` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=42 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `tborderitems`
-- ----------------------------
DROP TABLE IF EXISTS `tborderitems`;
CREATE TABLE `tborderitems` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `orderid` varchar(255) DEFAULT NULL,
  `proid` int(11) DEFAULT NULL,
  `proname` varchar(255) DEFAULT NULL,
  `price` decimal(10,0) DEFAULT NULL,
  `procount` int(11) DEFAULT NULL,
  `imgurl` varchar(500) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=85 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `tbproduct`
-- ----------------------------
DROP TABLE IF EXISTS `tbproduct`;
CREATE TABLE `tbproduct` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `proname` varchar(255) DEFAULT NULL,
  `pronum` varchar(255) DEFAULT NULL,
  `typeid` int(11) DEFAULT NULL,
  `price` decimal(10,0) DEFAULT NULL,
  `brief` varchar(255) DEFAULT NULL,
  `descriptions` text,
  `address` varchar(255) DEFAULT NULL,
  `procount` int(11) DEFAULT '0',
  `imgurl` varchar(255) DEFAULT NULL,
  `procodeurl` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=78 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `tbrepair`
-- ----------------------------
DROP TABLE IF EXISTS `tbrepair`;
CREATE TABLE `tbrepair` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '报修表',
  `proid` int(11) DEFAULT NULL,
  `pronum` varchar(255) DEFAULT NULL,
  `proname` varchar(255) DEFAULT NULL,
  `protype` varchar(255) DEFAULT NULL,
  `proimgurl` varchar(255) DEFAULT NULL,
  `tbmaster` varchar(255) DEFAULT NULL,
  `tbmastertel` varchar(255) DEFAULT NULL,
  `tberror` varchar(255) DEFAULT NULL,
  `ctime` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `tbrolehasmenu`
-- ----------------------------
DROP TABLE IF EXISTS `tbrolehasmenu`;
CREATE TABLE `tbrolehasmenu` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `roleid` int(11) DEFAULT NULL,
  `rolename` varchar(255) DEFAULT NULL,
  `menuid` int(11) DEFAULT NULL,
  `menuname` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=162 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `tbroles`
-- ----------------------------
DROP TABLE IF EXISTS `tbroles`;
CREATE TABLE `tbroles` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `rolename` varchar(50) DEFAULT NULL,
  `memo` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `tbsaleorderhead`
-- ----------------------------
DROP TABLE IF EXISTS `tbsaleorderhead`;
CREATE TABLE `tbsaleorderhead` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `orderid` varchar(255) DEFAULT NULL,
  `sname` varchar(255) DEFAULT NULL,
  `stel` varchar(255) DEFAULT NULL,
  `saddress` varchar(255) DEFAULT NULL,
  `sumprice` decimal(11,0) DEFAULT '0',
  `memberid` int(11) DEFAULT NULL,
  `ctime` varchar(255) DEFAULT NULL,
  `ptime` varchar(255) DEFAULT NULL,
  `memo` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `tbsaleorderitems`
-- ----------------------------
DROP TABLE IF EXISTS `tbsaleorderitems`;
CREATE TABLE `tbsaleorderitems` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `orderid` varchar(255) DEFAULT NULL,
  `proid` int(11) DEFAULT NULL,
  `proname` varchar(255) DEFAULT NULL,
  `price` decimal(10,0) DEFAULT NULL COMMENT '车辆价格',
  `procount` int(11) DEFAULT NULL,
  `imgurl` varchar(500) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=53 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `tbshoppingcar`
-- ----------------------------
DROP TABLE IF EXISTS `tbshoppingcar`;
CREATE TABLE `tbshoppingcar` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `sessionid` varchar(32) DEFAULT NULL,
  `proname` varchar(255) DEFAULT NULL,
  `proid` int(11) DEFAULT NULL,
  `procount` int(11) DEFAULT NULL,
  `ctime` varchar(255) DEFAULT NULL,
  `imgurl` varchar(255) DEFAULT NULL,
  `price` decimal(10,0) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=92 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `tbshoppingcarforsale`
-- ----------------------------
DROP TABLE IF EXISTS `tbshoppingcarforsale`;
CREATE TABLE `tbshoppingcarforsale` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `sessionid` varchar(32) DEFAULT NULL,
  `proname` varchar(255) DEFAULT NULL,
  `proid` int(11) DEFAULT NULL,
  `procount` int(11) DEFAULT NULL,
  `ctime` varchar(255) DEFAULT NULL,
  `imgurl` varchar(255) DEFAULT NULL,
  `price` decimal(10,0) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `tbsupplier`
-- ----------------------------
DROP TABLE IF EXISTS `tbsupplier`;
CREATE TABLE `tbsupplier` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `companyname` varchar(255) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `tel` varchar(255) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `tbtype`
-- ----------------------------
DROP TABLE IF EXISTS `tbtype`;
CREATE TABLE `tbtype` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `typename` varchar(255) DEFAULT NULL,
  `parentname` varchar(255) DEFAULT NULL,
  `parentid` int(11) DEFAULT NULL,
  `fullpath` varchar(255) DEFAULT NULL,
  `levelnum` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=40 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `tbuserhasrole`
-- ----------------------------
DROP TABLE IF EXISTS `tbuserhasrole`;
CREATE TABLE `tbuserhasrole` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userid` int(11) DEFAULT NULL,
  `username` varchar(255) DEFAULT NULL,
  `roleid` int(11) DEFAULT NULL,
  `rolename` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `tbusers`
-- ----------------------------
DROP TABLE IF EXISTS `tbusers`;
CREATE TABLE `tbusers` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(20) DEFAULT NULL,
  `password` varchar(20) DEFAULT NULL,
  `truename` varchar(20) DEFAULT NULL,
  `tel` varchar(255) DEFAULT NULL,
  `memo` varchar(255) DEFAULT NULL,
  `creatorid` int(11) DEFAULT NULL,
  `createtime` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8;

-- ----------------------------
--  View definition for `v_product`
-- ----------------------------
DROP VIEW IF EXISTS `v_product`;
CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `v_product` AS select `tbproduct`.`id` AS `id`,`tbproduct`.`proname` AS `proname`,`tbproduct`.`pronum` AS `pronum`,`tbproduct`.`typeid` AS `typeid`,`tbproduct`.`price` AS `price`,`tbproduct`.`brief` AS `brief`,`tbproduct`.`descriptions` AS `descriptions`,`tbproduct`.`address` AS `address`,`tbproduct`.`procount` AS `procount`,`tbproduct`.`imgurl` AS `imgurl`,`tbproduct`.`procodeurl` AS `procodeurl`,`tbtype`.`levelnum` AS `levelnum`,`tbtype`.`typename` AS `typename`,`tbtype`.`fullpath` AS `fullpath` from (`tbproduct` left join `tbtype` on((`tbproduct`.`typeid` = `tbtype`.`id`)));

-- ----------------------------
--  View definition for `v_sale`
-- ----------------------------
DROP VIEW IF EXISTS `v_sale`;
CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `v_sale` AS select `tbsaleorderitems`.`orderid` AS `orderid`,`tbsaleorderitems`.`id` AS `id`,`tbsaleorderitems`.`proid` AS `proid`,`tbsaleorderitems`.`proname` AS `proname`,`tbsaleorderitems`.`price` AS `price`,`tbsaleorderitems`.`procount` AS `procount`,`tbproduct`.`typeid` AS `typeid`,`tbtype`.`typename` AS `typename`,`tbtype`.`parentname` AS `parentname`,`tbtype`.`fullpath` AS `fullpath`,`tbtype`.`levelnum` AS `levelnum`,`tbtype`.`parentid` AS `parentid`,substring_index(`tbtype`.`fullpath`,'/',1) AS `bigclass` from ((`tbsaleorderitems` left join `tbproduct` on((`tbsaleorderitems`.`proid` = `tbproduct`.`id`))) left join `tbtype` on((`tbproduct`.`typeid` = `tbtype`.`id`)));

-- ----------------------------
--  Records 
-- ----------------------------
INSERT INTO `tbinout` VALUES ('13','1','76','HC-XY-X30','华晨鑫源-海狮X30L','面包车','20200911105059941.jpg','0','15','台','2020-09-11 11:00:41'), ('14','1','29','AD-A3-001','奥迪A3','轿车/小型车','20200910100002213.png','0','15','台','2020-09-11 11:05:10'), ('15','1','25','AD-RS3-001','奥迪RS 3','轿车/紧凑型车','20200908161850529.png','0','49','台','2020-09-11 11:05:21'), ('16','1','26','AD-S3-001','奥迪S3','轿车/紧凑型车','20200908162250558.png','2','45','台','2020-09-11 11:05:32'), ('17','1','27','BC-A-001','奔驰A级','轿车/紧凑型车','20200908162852194.png','2','23','台','2020-09-11 11:05:46'), ('18','1','28','BC-B-001','奔驰B级','轿车/紧凑型车','20200908163238349.png','0','52','台','2020-09-11 11:05:59'), ('19','1','29','AD-A3-001','奥迪A3','轿车/小型车','20200910100002213.png','15','1','台','2020-09-11 11:06:12'), ('20','1','30','AD-A4—J1','奥迪A4（进口）','轿车/小型车','20200910110447322.jpg','0','42','台','2020-09-11 11:06:38'), ('21','1','31','BM-JK-001','宝马（进口）','轿车/小型车','20200910111020663.jpg','0','52','台','2020-09-11 11:07:25'), ('22','1','32','BT-XR-V','东风本田','轿车/小型车','20200910111247604.jpg','0','31','台','2020-09-11 11:07:44'), ('23','1','33','BJ-310','宝骏310','轿车/小型车','20200910111448107.jpg','0','12','台','2020-09-11 11:07:56'), ('24','1','33','BJ-310','宝骏310','轿车/小型车','20200910111448107.jpg','12','1','台','2020-09-11 11:08:09'), ('25','1','34','BJ-3102','东风标致2008','轿车/小型车','20200910111824382.jpg','0','21','台','2020-09-11 11:08:46'), ('26','1','35','CA-YX-001','长安悦翔','轿车/小型车','20200910111957991.jpg','0','13','台','2020-09-11 11:08:58'), ('27','1','36','DZ-Polo-001','上汽大众','轿车/小型车','20200910112139438.jpg','0','41','台','2020-09-11 11:10:03'), ('28','1','37','AD-Q5L','奥迪Q5L','轿车/中型车','20200910112522347.jpg','0','21','台','2020-09-11 11:10:16'), ('29','1','38','Giulia','阿尔法·罗密欧','轿车/中型车','20200910112919477.jpg','0','24','台','2020-09-11 11:10:30'), ('30','1','39','BM-CM-01','宝马3系','轿车/中型车','20200910113140117.jpg','0','21','台','2020-09-11 11:10:39'), ('31','1','40','XD-XX-08','领动','轿车/中型车','20200910114051592.jpg','0','21','台','2020-09-11 11:10:50'), ('32','1','41','BC-C-01','北京奔驰C级','轿车/中型车','20200910154810955.jpg','0','18','台','2020-09-11 11:11:01'), ('33','1','42','JB-XEL-01','捷豹XEL','轿车/中型车','20200910154958691.jpg','0','50','台','2020-09-11 11:11:12'), ('34','1','43','BYD-E-1','比亚迪e1','轿车/微型车','20200910155251742.jpg','0','40','台','2020-09-11 11:11:23'), ('35','1','44','XF-E-11','幸福e+','轿车/微型车','20200910155516014.jpg','0','20','台','2020-09-11 11:12:29'), ('36','1','45','LB-A0-1','路宝','轿车/微型车','20200910155646329.jpg','0','24','台','2020-09-11 11:12:39'), ('37','1','46','Yeti','斯柯达（进口）','轿车/微型车','20200910155906341.jpg','0','11','台','2020-09-11 11:12:51'), ('38','1','47','ZT-E-200','众泰E200','轿车/微型车','20200910160042287.jpg','0','24','台','2020-09-11 11:13:02'), ('39','1','48','AD-A8-01','奥迪A8（进口）','轿车/大型车','20200910160248428.jpg','0','64','台','2020-09-11 11:13:23'), ('40','1','49','BC-S-01','奔驰S级','轿车/大型车','20200910160456617.jpg','0','14','台','2020-09-11 11:13:34'), ('41','1','50','BSJ-A-01','Panamera','轿车/大型车','20200910160655597.jpg','0','14','台','2020-09-11 11:13:45'), ('42','1','51','BL-FC-01','宾利飞驰','轿车/大型车','20200910160900255.jpg','0','52','台','2020-09-11 11:13:56'), ('43','1','52','LKSS-LS-1','雷克萨斯LS','轿车/大型车','20200910161034208.jpg','0','42','台','2020-09-11 11:14:17'), ('44','1','53','AD-R8-01','奥迪R8','跑车/轿跑','20200910161648396.jpg','0','14','台','2020-09-11 11:14:30'), ('45','1','54','V8 Vantage','阿斯顿·马丁','轿车','20200910161938700.jpg','0','54','台','2020-09-11 11:14:41'), ('46','1','55','BC-SlC-1','奔驰SLC','跑车/敞篷跑车','20200910162421279.jpg','0','34','台','2020-09-11 11:14:53'), ('47','1','56','BC-AMG-1','奔驰AMG GT','跑车/敞篷跑车','20200910162555536.jpg','0','25','台','2020-09-11 11:15:05'), ('48','1','57','BM-Z4-1','宝马Z4','跑车/敞篷跑车','20200910162725678.jpg','0','12','台','2020-09-11 11:15:14'), ('49','1','58','BSJ-718','保时捷718','跑车/敞篷跑车','20200910162911794.jpg','0','64','台','2020-09-11 11:15:24'), ('50','1','59','BL-OL-1','宾利欧陆','跑车/敞篷跑车','20200910163126294.jpg','0','12','台','2020-09-11 11:15:34'), ('51','1','60','BBS-SLK-1','巴博斯 SLK级','跑车/轿跑','20200910163304030.jpg','0','12','台','2020-09-11 11:15:49'), ('52','1','61','BJD-WH-01','威航','跑车/轿跑','20200910163737040.jpg','0','12','台','2020-09-11 11:15:59'), ('53','1','62','FT-Mustang','福特Mustang','跑车/轿跑','20200910164048384.jpg','0','24','台','2020-09-11 11:16:13'), ('54','1','63','FLL-GTC4Lusso','法拉利GTC4Lusso','跑车/双门跑车','20200910164255926.jpg','0','15','台','2020-09-11 11:16:31'), ('55','1','64','JCHL-A','交叉火力','跑车/双门跑车','20200910164513479.jpg','0','15','台','2020-09-11 11:17:06'), ('56','1','65','Agera-A','科尼塞克Agera','跑车/双门跑车','20200910164713868.jpg','0','35','台','2020-09-11 11:17:17'), ('57','1','66','LKSS-LC-3','雷克萨斯LC','跑车/双门跑车','20200910164852294.jpg','0','53','台','2020-09-11 11:17:29'), ('58','1','67','LSLS-MY-1','劳斯莱斯-魅影','跑车/双门跑车','20200910165026686.jpg','0','34','台','2020-09-11 11:17:41'), ('59','1','68','XFL-435T','2019款 435T CVT两驱逸锐版 国VI','越野车','20200911103824640.jpg','0','12','台','2020-09-11 11:17:51'), ('60','1','69','PRO-260T','2020款 PRO 260T DCT Battle','越野车','20200911103921017.jpg','0','34','台','2020-09-11 11:18:09'), ('61','1','70','530-V6','2019款 530 V6 四驱尊崇旗舰版','越野车','20200911104057877.jpg','0','25','台','2020-09-11 11:18:22'), ('62','1','71','652E','2020款 652E 互联智慧型','越野车','20200911104216126.jpg','0','35','台','2020-09-11 11:18:37'), ('63','1','72','X70',' 捷途X70 2018款 1.5T 自动尊行版','越野车','20200911104337652.jpg','0','12','台','2020-09-11 11:18:47'), ('64','1','73','WL-HG-1','上汽通用五菱-五菱宏光','面包车','20200911104542285.jpg','0','35','台','2020-09-11 11:18:58'), ('65','1','74','CA-KC-91','长安凯程-欧诺S','面包车','20200911104703925.jpg','0','24','台','2020-09-11 11:19:09'), ('66','1','75','DF-XK-45','东风小康-东风小康C56','面包车','20200911104923766.jpg','0','13','台','2020-09-11 11:19:20'), ('67','1','76','HC-XY-X30','华晨鑫源-海狮X30L','面包车','20200911105059941.jpg','15','41','台','2020-09-11 11:19:29'), ('68','1','77','CA-KC-05','长安凯程-长安之星5','面包车','20200911105258120.jpg','0','35','台','2020-09-11 11:19:39'), ('69','1','77','CA-KC-05','长安凯程-长安之星5','面包车','20200911105258120.jpg','35','1','台','2020-09-11 15:12:54'), ('70','1','33','BJ-310','宝骏310','轿车/小型车','20200910111448107.jpg','13','12','台','2020-09-12 09:51:27');
INSERT INTO `tblog` VALUES ('1','1','1','超级管理员','正常登录系统','2020-09-14 11:46:44'), ('2','3','0','未知','登录系统失败，用户名为：admin密码：1234560000','2020-09-14 11:47:22'), ('3','3','0','未知','登录系统失败，用户名为：admin密码：1111111111111','2020-09-14 11:47:37'), ('4','1','1','超级管理员','正常登录系统','2020-09-14 11:47:41'), ('5','1','1','超级管理员','正常登录系统','2020-09-14 15:32:14'), ('6','1','1','超级管理员','正常登录系统','2020-09-14 15:37:21'), ('7','1','1','超级管理员','正常登录系统','2020-09-14 15:54:40'), ('8','2','1','超级管理员','null修改密码成功','2020-09-14 15:55:01'), ('9','1','1','超级管理员','正常登录系统','2020-09-14 15:55:14'), ('10','3','1','超级管理员','登录系统失败，用户名为：admin密码：123456','2020-09-14 16:04:03'), ('11','1','1','超级管理员','正常登录系统','2020-09-14 16:04:13'), ('12','2','1','超级管理员','超级管理员修改密码成功','2020-09-14 16:04:30'), ('13','1','1','超级管理员','正常登录系统','2020-09-14 16:04:36'), ('14','2','1','超级管理员','超级管理员修改密码失败','2020-09-14 16:05:18'), ('15','1','1','超级管理员','正常登录系统','2020-09-14 16:11:50'), ('16','3','1','超级管理员','超级管理员修改密码失败','2020-09-14 16:12:01'), ('17','3','1','超级管理员','登录系统失败，用户名为:admin密码：123456111','2020-09-14 16:28:15'), ('18','1','1','超级管理员','正常登录系统','2020-09-14 16:28:21'), ('19','1','1','超级管理员','正常登录系统','2020-09-14 17:06:49'), ('20','1','1','超级管理员','正常登录系统','2020-09-15 09:43:39'), ('21','1','1','超级管理员','正常登录系统','2020-09-15 10:41:41'), ('22','1','1','超级管理员','正常登录系统','2020-09-15 10:51:00'), ('23','1','1','超级管理员','正常登录系统','2020-09-15 10:54:19'), ('24','1','1','超级管理员','正常登录系统','2020-09-15 10:55:36'), ('25','1','1','超级管理员','正常登录系统','2020-09-15 10:57:49'), ('26','1','1','超级管理员','正常登录系统','2020-09-15 10:58:12'), ('27','1','1','超级管理员','正常登录系统','2020-09-15 11:03:03'), ('28','1','1','超级管理员','正常登录系统','2020-09-15 11:11:59'), ('29','1','1','超级管理员','正常登录系统','2020-09-15 11:14:33'), ('30','1','1','超级管理员','正常登录系统','2020-09-15 11:22:55'), ('31','1','1','超级管理员','正常登录系统','2020-09-15 11:29:22'), ('32','1','1','超级管理员','正常登录系统','2020-09-15 11:37:47'), ('33','1','1','超级管理员','正常登录系统','2020-09-15 11:39:47'), ('34','1','1','超级管理员','正常登录系统','2020-09-15 11:43:06'), ('35','1','1','超级管理员','正常登录系统','2020-09-15 15:37:43'), ('36','1','1','超级管理员','正常登录系统','2020-09-15 16:25:04'), ('37','1','1','超级管理员','正常登录系统','2020-09-16 16:38:11'), ('38','1','1','超级管理员','正常登录系统','2020-09-16 16:38:20'), ('39','3','1','超级管理员','登录系统失败，用户名为:admin密码：1    1=1','2020-09-16 16:41:53'), ('40','1','1','超级管理员','正常登录系统','2020-09-16 16:41:58'), ('41','1','1','超级管理员','正常登录系统','2020-09-16 16:42:17'), ('42','1','1','超级管理员','正常登录系统','2020-09-17 09:55:20');
INSERT INTO `tbmenubar` VALUES ('1','系统设置','0','1','1',NULL,'','1','1'), ('2','商品中心','0','1','2','./gonggao','','2','1'), ('3','进货管理','0','1','3','./gonggao','','3','1'), ('4','销售管理','0','1','4',NULL,'','4','1'), ('5','库存管理','0','1','5',NULL,'','7','1'), ('6','报表管理','0','1','6',NULL,'','8','1'), ('7','密码修改','1','2','1,7','./admin/passwordedit.jsp','main','1','1'), ('8','新增用户','1','2','1,8','./admin/usersadd.jsp','main','1','1'), ('9','建根类别','2','2','2,9','./admin/tbtypeadd.jsp','main','1','1'), ('10','管理类别','2','2','2,10','./tbtypelist','main','1','1'), ('11','新增商品','2','2','2,11','./admin/proadd.jsp','main','1','1'), ('12','管理商品','2','2','2,12','./prolist','main','1','1'), ('13','创建进货单','3','2','3,13','./admin/ordermain.jsp','main','1','1'), ('14','管理进货单','3','2','3,14','./orderheadlist','main','2','1'), ('15','销售开单','4','2','4,15','./admin/ordermainforsale.jsp','main','1','1'), ('16','维护订单','4','2','4,16','./orderheadlistforsale','main','1','1'), ('17','库存入库','5','2','5,17','./admin/proinout.jsp?t=1','main','1','1'), ('18','商品出库','5','2','5,18','./admin/proinout.jsp?t=-1','main','1','1'), ('19','商品查询','5','2','5,19','prolistforsearch','main','1','1'), ('20','管理用户','1','2','1,20','./userslist','main','1','1'), ('21','新增角色','1','2','1,21','./admin/roleadd.jsp','main','1','1'), ('22','角色管理','1','2','1,22','./rolelist','main','1','1'), ('23','入库管理','0','1','23','',NULL,'5','0'), ('24','出库管理','0','1','24',NULL,NULL,'6','0'), ('25','明细查询','5','2','5,25','./inoutlist','main','1','1'), ('26','进货报表','6','2','6,26','./admin/jinhuo.jsp','main','1','1'), ('27','报修管理','0','1','27',NULL,NULL,'9','1'), ('28','新增报修','27','2','27,28','./admin/repairadd.jsp','main','1','1'), ('29','报修记录','27','2','27,29','./repairlist','main','1','1'), ('30','销售报表','6','2','6,30','./admin/xiaoshou.jsp','main','2','1'), ('31','占比报表','6','2','6,31','./admin/zhanbi.jsp','main','3','1'), ('32','通知中心','0','1','32',NULL,NULL,'10','1'), ('33','发布通知','32','1','32,33','./admin/newsadd.jsp','main','1','1'), ('34','通知记录','32','2','32,34','./newslist','main','2','1'), ('35','日志管理','1','2','1,35','./tbloglist','main','1','1');
INSERT INTO `tbnews` VALUES ('3',NULL,'超级管理员',NULL,'2020-09-12 16:18:04',NULL), ('4','劳动经济基础','超级管理员','各色各二个是','2020-09-12 16:21:02','1');
INSERT INTO `tborderhead` VALUES ('35','20200910104226798','超级管理员','15397600038','四川成都总部','193','1','2020-09-10 10:42:26',NULL,NULL), ('36','20200910154147867','超级管理员','15397600038','四川成都总部','572','1','2020-09-10 15:41:47',NULL,NULL), ('37','20200910154158738','超级管理员','15397600038','四川成都总部','87','1','2020-09-10 15:41:58',NULL,NULL), ('38','20200910154213506','超级管理员','15397600038','四川成都总部','58','1','2020-09-10 15:42:13',NULL,NULL), ('39','20200911145534448','超级管理员','15397600038','四川成都总部','12','1','2020-09-11 14:55:34',NULL,NULL), ('40','20200912091454739','超级管理员','15397600038','四川成都总部','5','1','2020-09-12 09:14:54',NULL,NULL), ('41','20200915162920571','超级管理员','15397600038','四川成都总部','4339','1','2020-09-15 16:29:20',NULL,NULL);
INSERT INTO `tborderitems` VALUES ('53','20200910104226798','29','奥迪A3','131','1','20200910100002213.png'), ('54','20200910104226798','28','奔驰B级','33','1','20200908163238349.png'), ('55','20200910104226798','27','奔驰A级','29','1','20200908162852194.png'), ('56','20200910154147867','40','领动','20','1','20200910114051592.jpg'), ('57','20200910154147867','39','宝马3系','30','1','20200910113140117.jpg'), ('58','20200910154147867','38','阿尔法·罗密欧','37','1','20200910112919477.jpg'), ('59','20200910154147867','37','奥迪Q5L','50','1','20200910112522347.jpg'), ('60','20200910154147867','36','上汽大众','12','1','20200910112139438.jpg'), ('61','20200910154147867','35','长安悦翔','7','1','20200910111957991.jpg'), ('62','20200910154147867','34','东风标致2008','15','1','20200910111824382.jpg'), ('63','20200910154147867','33','宝骏310','6','1','20200910111448107.jpg'), ('64','20200910154147867','32','东风本田','18','1','20200910111247604.jpg'), ('65','20200910154147867','31','宝马（进口）','31','1','20200910111020663.jpg'), ('66','20200910154147867','30','奥迪A4（进口）','43','1','20200910110447322.jpg'), ('67','20200910154147867','29','奥迪A3','131','1','20200910100002213.png'), ('68','20200910154147867','28','奔驰B级','33','1','20200908163238349.png'), ('69','20200910154147867','27','奔驰A级','29','1','20200908162852194.png'), ('70','20200910154147867','26','奥迪S3','36','1','20200908162250558.png'), ('71','20200910154147867','25','奥迪RS 3','51','1','20200908161850529.png'), ('72','20200910154147867','24','奥迪A3','23','1','20200908160800980.png'), ('73','20200910154158738','40','领动','20','1','20200910114051592.jpg'), ('74','20200910154158738','39','宝马3系','30','1','20200910113140117.jpg'), ('75','20200910154158738','38','阿尔法·罗密欧','37','1','20200910112919477.jpg'), ('76','20200910154213506','36','上汽大众','12','1','20200910112139438.jpg'), ('77','20200910154213506','35','长安悦翔','7','1','20200910111957991.jpg'), ('78','20200910154213506','34','东风标致2008','15','1','20200910111824382.jpg'), ('79','20200910154213506','33','宝骏310','6','1','20200910111448107.jpg'), ('80','20200910154213506','32','东风本田','18','1','20200910111247604.jpg'), ('81','20200911145534448','77','长安凯程-长安之星5','4','3','20200911105258120.jpg'), ('82','20200912091454739','76','华晨鑫源-海狮X30L','5','1','20200911105059941.jpg'), ('83','20200915162920571','62','福特Mustang','39','1','20200910164048384.jpg'), ('84','20200915162920571','61','威航','4300','1','20200910163737040.jpg');
INSERT INTO `tbproduct` VALUES ('24','奥迪A3','AD-A3-001','34','23','两厢/三厢','','1.4T','16','20200908160800980.png','20200916165222959.jpg'), ('25','奥迪RS 3','AD-RS3-001','34','51','两厢/三厢','','2.5T','49','20200908161850529.png','20200916165216296.jpg'), ('26','奥迪S3','AD-S3-001','34','36','两厢','','2.0T','45','20200908162250558.png','20200916165204117.jpg'), ('27','奔驰A级','BC-A-001','34','29','三厢','','2.0T','23','20200908162852194.png','20200916165158160.jpg'), ('28','奔驰B级','BC-B-001','34','33','两厢','','2.0T','52','20200908163238349.png','20200916165500564.jpg'), ('29','奥迪A3','AD-A3-007','32','131','两厢','','2.0T','16','20200910100002213.png','20200916165452549.jpg'), ('30','奥迪A4（进口）','AD-A4—J1','32','43','旅行版','','2.0T','42','20200910110447322.jpg','20200916165444655.jpg'), ('31','宝马（进口）','BM-JK-001','32','31','两厢/三厢','','170马力','52','20200910111020663.jpg','20200916165435078.jpg'), ('32','东风本田','BT-XR-V','32','18','SUV','','1.5T','31','20200910111247604.jpg','20200916165425422.jpg'), ('33','宝骏310','BJ-310','32','6','两厢','','1.2T/1.5T','25','20200910111448107.jpg','20200916165310415.jpg'), ('34','东风标致2008','BJ-3102','32','15','SUV','','1.2T','21','20200910111824382.jpg','20200916165300918.jpg'), ('35','长安悦翔','CA-YX-001','32','7','三厢','','1.5T','13','20200910111957991.jpg','20200916165252975.jpg'), ('36','上汽大众','DZ-Polo-001','32','12','两厢','','1.5T','41','20200910112139438.jpg','20200916165241976.jpg'), ('37','奥迪Q5L','AD-Q5L','33','50','SUV','','2.0T','21','20200910112522347.jpg','20200916165235357.jpg'), ('38','阿尔法·罗密欧','Giulia','33','37','三厢','','2.0T','24','20200910112919477.jpg','20200916165149415.jpg'), ('39','宝马3系','BM-CM-01','33','30','三厢','','2.0T','21','20200910113140117.jpg','20200916165137758.jpg'), ('40','领动','XD-XX-08','33','20','两厢','','1.5T','21','20200910114051592.jpg','20200916165039668.jpg'), ('41','北京奔驰C级','BC-C-01','33','47','三厢','','2.0T','18','20200910154810955.jpg','20200916164956198.jpg'), ('42','捷豹XEL','JB-XEL-01','33','38','三厢','','2.0T','50','20200910154958691.jpg','20200916164941800.jpg'), ('43','比亚迪e1','BYD-E-1','31','8','','','61马力','40','20200910155251742.jpg','20200916164929598.jpg'), ('44','幸福e+','XF-E-11','31','7','','','57马力','20','20200910155516014.jpg','20200916164903353.jpg'), ('45','路宝','LB-A0-1','31','5','两厢','','1.3L','24','20200910155646329.jpg','20200916164853070.jpg'), ('46','斯柯达（进口）','Yeti','31','33','SUV','','1.8T','11','20200910155906341.jpg','20200916164835551.jpg'), ('47','众泰E200','ZT-E-200','31','7','','','82马力','24','20200910160042287.jpg','20200916164814303.jpg'), ('48','奥迪A8（进口）','AD-A8-01','35','115','三厢','','3.0T','64','20200910160248428.jpg','20200916164805462.jpg'), ('49','奔驰S级','BC-S-01','35','122','三厢','','3.0T','14','20200910160456617.jpg','20200916164756254.jpg'), ('50','Panamera','BSJ-A-01','35','245','旅行版','','4.0T','14','20200910160655597.jpg','20200916164746700.jpg'), ('51','宾利飞驰','BL-FC-01','35','306','三厢','','6.0T','52','20200910160900255.jpg','20200916164736319.jpg'), ('52','雷克萨斯LS','LKSS-LS-1','35','117','三厢','','3.5T','42','20200910161034208.jpg','20200916164726798.jpg'), ('53','奥迪R8','AD-R8-01','37','229','硬顶跑车','','5.2L','14','20200910161648396.jpg','20200916164717750.jpg'), ('54','阿斯顿·马丁','V8 Vantage','37','259','硬顶跑车','','4.0T','54','20200910161938700.jpg','20200916164707928.jpg'), ('55','奔驰SLC','BC-SlC-1','39','62','软顶敞篷车','','2.0T','34','20200910162421279.jpg','20200916164656006.jpg'), ('56','奔驰AMG GT','BC-AMG-1','39','229','软顶敞篷车','','4.0T','25','20200910162555536.jpg','20200916164645502.jpg'), ('57','宝马Z4','BM-Z4-1','39','63','软顶敞篷车','','3.0T','12','20200910162725678.jpg','20200916164636166.jpg'), ('58','保时捷718','BSJ-718','39','89','软顶敞篷车','','2.5T','64','20200910162911794.jpg','20200916164624888.jpg'), ('59','宾利欧陆','BL-OL-1','39','346','软顶敞篷车','','6.0T','12','20200910163126294.jpg','20200916164616869.jpg'), ('60','巴博斯 SLK级','BBS-SLK-1','37','62','硬顶跑车','','1.8T','12','20200910163304030.jpg','20200916164607672.jpg'), ('61','威航','BJD-WH-01','37','4300','硬顶跑车','','8.0T','12','20200910163737040.jpg','20200916164600237.jpg'), ('62','福特Mustang','FT-Mustang','37','39','硬顶跑车','','2.3T','24','20200910164048384.jpg','20200916164552789.jpg'), ('63','法拉利GTC4Lusso','FLL-GTC4Lusso','38','473','双门跑车','','6.3L','15','20200910164255926.jpg','20200916164544284.jpg'), ('64','交叉火力','JCHL-A','38','61','双门跑车','','3.2L','15','20200910164513479.jpg','20200916164524581.jpg'), ('65','科尼塞克Agera','Agera-A','38','2650','双门跑车','','5.0T','35','20200910164713868.jpg','20200916164516901.jpg'), ('66','雷克萨斯LC','LKSS-LC-3','38','126','双门跑车','','3.5L','53','20200910164852294.jpg','20200916164509905.jpg'), ('67','劳斯莱斯-魅影','LSLS-MY-1','38','590','双门跑车','','6.6T','34','20200910165026686.jpg','20200916164501998.jpg'), ('68','2019款 435T CVT两驱逸锐版 国VI','XFL-435T','3','14','两厢','','2.0T','12','20200911103824640.jpg','20200916164451976.jpg'), ('69','2020款 PRO 260T DCT Battle','PRO-260T','3','12','两厢','','3.0T','34','20200911103921017.jpg','20200916164447149.jpg'), ('70','2019款 530 V6 四驱尊崇旗舰版','530-V6','3','44','两厢','','3.0T','25','20200911104057877.jpg','20200916164439711.jpg'), ('71','2020款 652E 互联智慧型','652E','3','19','两厢','','2.0T','35','20200911104216126.jpg','20200916164433704.jpg'), ('72',' 捷途X70 2018款 1.5T 自动尊行版','X70','3','14','两厢','','2.0T','12','20200911104337652.jpg','20200916164427464.jpg'), ('73','上汽通用五菱-五菱宏光','WL-HG-1','4','7','7座','','1.5T','35','20200911104542285.jpg','20200916164421478.jpg'), ('74','长安凯程-欧诺S','CA-KC-91','4','6','7座','','1.5T','24','20200911104703925.jpg','20200916164416470.jpg'), ('75','东风小康-东风小康C56','DF-XK-45','4','6','9座','','1.5T','13','20200911104923766.jpg','20200916164412637.jpg'), ('76','华晨鑫源-海狮X30L','HC-XY-X30','4','5','7座','','1.5T','56','20200911105059941.jpg','20200916164408090.jpg'), ('77','长安凯程-长安之星5','CA-KC-05','4','4','7座','','1.5T','34','20200911105258120.jpg','20200916164334898.jpg');
INSERT INTO `tbrepair` VALUES ('4','76','HC-XY-X30','华晨鑫源-海狮X30L','面包车','20200911105059941.jpg','饿1211','21额','饿1','2020-09-15 11:43:31'), ('5','76','HC-XY-X30','华晨鑫源-海狮X30L','面包车','20200911105059941.jpg','陈梦','13142114123','轮胎','2020-09-15 16:28:45');
INSERT INTO `tbrolehasmenu` VALUES ('93','1',NULL,'22',NULL), ('94','1',NULL,'21',NULL), ('95','1',NULL,'20',NULL), ('96','1',NULL,'19',NULL), ('97','1',NULL,'18',NULL), ('98','1',NULL,'17',NULL), ('99','1',NULL,'16',NULL), ('100','1',NULL,'15',NULL), ('101','1',NULL,'14',NULL), ('102','1',NULL,'13',NULL), ('103','1',NULL,'12',NULL), ('104','1',NULL,'11',NULL), ('105','1',NULL,'10',NULL), ('106','1',NULL,'9',NULL), ('107','1',NULL,'8',NULL), ('108','1',NULL,'7',NULL), ('109','1',NULL,'6',NULL), ('110','1',NULL,'5',NULL), ('111','1',NULL,'4',NULL), ('112','1',NULL,'3',NULL), ('113','1',NULL,'2',NULL), ('114','1',NULL,'1',NULL), ('115','2',NULL,'22',NULL), ('116','2',NULL,'21',NULL), ('117','2',NULL,'20',NULL), ('118','2',NULL,'19',NULL), ('119','2',NULL,'18',NULL), ('120','2',NULL,'17',NULL), ('121','2',NULL,'16',NULL), ('122','2',NULL,'15',NULL), ('123','2',NULL,'14',NULL), ('124','2',NULL,'13',NULL), ('125','2',NULL,'12',NULL), ('126','2',NULL,'11',NULL), ('127','2',NULL,'10',NULL), ('128','2',NULL,'9',NULL), ('129','2',NULL,'8',NULL), ('130','2',NULL,'7',NULL), ('131','2',NULL,'6',NULL), ('132','2',NULL,'5',NULL), ('133','2',NULL,'4',NULL), ('134','2',NULL,'3',NULL), ('135','2',NULL,'2',NULL), ('136','2',NULL,'1',NULL), ('137','3',NULL,'3',NULL), ('138','3',NULL,'14',NULL), ('139','3',NULL,'13',NULL), ('140','1',NULL,'24',NULL), ('141','1',NULL,'23',NULL), ('142','1',NULL,'25',NULL), ('143','1',NULL,'26',NULL), ('144','4',NULL,'19',NULL), ('145','4',NULL,'5',NULL), ('146','5',NULL,'6',NULL), ('147','5',NULL,'26',NULL), ('148','1',NULL,'29',NULL), ('149','1',NULL,'28',NULL), ('150','1',NULL,'27',NULL), ('151','1',NULL,'30',NULL), ('152','1',NULL,'31',NULL), ('153','1',NULL,'32',NULL), ('154','1',NULL,'34',NULL), ('155','1',NULL,'33',NULL), ('156','1',NULL,'35',NULL), ('157','4',NULL,'25',NULL), ('158','4',NULL,'24',NULL), ('159','4',NULL,'23',NULL), ('160','4',NULL,'18',NULL), ('161','4',NULL,'17',NULL);
INSERT INTO `tbroles` VALUES ('1','超级管理员','超级管理员'), ('2','管理员','管理员'), ('3','经销商','经销商'), ('4','仓库管理员','只能查询商品库存信息'), ('5','采购员','采购员');
INSERT INTO `tbsaleorderhead` VALUES ('1','20200908111459114','超级管理员','15397600038','四川成都总部','24099','1','2020-04-08 11:14:59',NULL,NULL), ('2','20200908111532688','超级管理员','15397600038','四川成都总部','24099','1','2020-06-08 11:15:32',NULL,NULL), ('3','20200908111612638','超级管理员','15397600038','四川成都总部','24099','1','2020-07-08 11:16:12',NULL,NULL), ('7','20200908153522539','超级管理员','15397600038','四川成都总部','15699','1','2020-09-08 15:35:22',NULL,NULL), ('8','20200908153907498','超级管理员','15397600038','四川成都总部','15699','1','2020-10-08 15:39:07',NULL,NULL), ('9','20200908154642012','超级管理员','15397600038','四川成都总部','15699','1','2020-12-08 15:46:42',NULL,NULL), ('10','20200910092905400','超级管理员','15397600038','四川成都总部','269','1','2020-09-10 09:29:05',NULL,NULL), ('11','20200910095144099','超级管理员','15397600038','四川成都总部','358','1','2020-09-10 09:51:44',NULL,NULL), ('12','20200910103213447','超级管理员','15397600038','四川成都总部','164','1','2020-09-10 10:32:13',NULL,NULL), ('13','20200910104350464','超级管理员','15397600038','四川成都总部','193','1','2020-09-10 10:43:50',NULL,NULL), ('14','20200911103418325','超级管理员','15397600038','四川成都总部','590','1','2020-09-11 10:34:18',NULL,NULL), ('15','20200911112323375','超级管理员','15397600038','四川成都总部','998','1','2020-09-11 11:23:23',NULL,NULL), ('16','20200911112340312','超级管理员','15397600038','四川成都总部','521','1','2020-09-11 11:23:40',NULL,NULL), ('17','20200911112357711','超级管理员','15397600038','四川成都总部','84','1','2020-09-11 11:23:57',NULL,NULL), ('18','20200911145437574','超级管理员','15397600038','四川成都总部','20','1','2020-09-11 14:54:37',NULL,NULL);
INSERT INTO `tbsaleorderitems` VALUES ('22','20200910092905400','28','奔驰B级','33','3','20200908163238349.png'), ('23','20200910092905400','27','奔驰A级','30','2','20200908162852194.png'), ('24','20200910092905400','26','奥迪S3','36','1','20200908162250558.png'), ('25','20200910092905400','25','奥迪RS 3','51','1','20200908161850529.png'), ('26','20200910092905400','24','奥迪A3','23','1','20200908160800980.png'), ('27','20200910095144099','28','奔驰B级','33','3','20200908163238349.png'), ('28','20200910095144099','27','奔驰A级','30','3','20200908162852194.png'), ('29','20200910095144099','26','奥迪S3','36','2','20200908162250558.png'), ('30','20200910095144099','25','奥迪RS 3','51','1','20200908161850529.png'), ('31','20200910095144099','24','奥迪A3','23','2','20200908160800980.png'), ('32','20200910103213447','29','奥迪A3','131','1','20200910100002213.png'), ('33','20200910103213447','28','奔驰B级','33','1','20200908163238349.png'), ('34','20200910104350464','29','奥迪A3','131','1','20200910100002213.png'), ('35','20200910104350464','28','奔驰B级','33','1','20200908163238349.png'), ('36','20200910104350464','27','奔驰A级','29','1','20200908162852194.png'), ('37','20200911103418325','67','劳斯莱斯-魅影','590','1','20200910165026686.jpg'), ('38','20200911112323375','77','长安凯程-长安之星5','4','6','20200911105258120.jpg'), ('39','20200911112323375','75','东风小康-东风小康C56','6','1','20200911104923766.jpg'), ('40','20200911112323375','74','长安凯程-欧诺S','6','1','20200911104703925.jpg'), ('41','20200911112323375','69','2020款 PRO 260T DCT Battle','12','1','20200911103921017.jpg'), ('42','20200911112323375','68','2019款 435T CVT两驱逸锐版 国VI','14','1','20200911103824640.jpg'), ('43','20200911112323375','67','劳斯莱斯-魅影','590','1','20200910165026686.jpg'), ('44','20200911112323375','59','宾利欧陆','346','1','20200910163126294.jpg'), ('45','20200911112340312','57','宝马Z4','63','1','20200910162725678.jpg'), ('46','20200911112340312','56','奔驰AMG GT','229','1','20200910162555536.jpg'), ('47','20200911112340312','53','奥迪R8','229','1','20200910161648396.jpg'), ('48','20200911112357711','37','奥迪Q5L','50','1','20200910112522347.jpg'), ('49','20200911112357711','36','上汽大众','12','1','20200910112139438.jpg'), ('50','20200911112357711','35','长安悦翔','7','1','20200910111957991.jpg'), ('51','20200911112357711','34','东风标致2008','15','1','20200910111824382.jpg'), ('52','20200911145437574','77','长安凯程-长安之星5','4','5','20200911105258120.jpg');
INSERT INTO `tbshoppingcar` VALUES ('75','41EFB73C20B2B946AB68D8917961A513','MateBook 13','21','1','2020-08-26 15:39:18','20200824172055164.png','5200'), ('76','41EFB73C20B2B946AB68D8917961A513','戴尔DELL灵越5000','20','1','2020-08-26 15:39:18','20200824171708716.png','4200'), ('85','1046DADD56CA5895C1445FAE81904BFC','奔驰B级','28','1','2020-09-10 10:07:42','20200908163238349.png','33'), ('86','1046DADD56CA5895C1445FAE81904BFC','奔驰A级','27','1','2020-09-10 10:07:42','20200908162852194.png','30'), ('87','1046DADD56CA5895C1445FAE81904BFC','奥迪A3','29','1','2020-09-10 10:07:50','20200910100002213.png','131'), ('88','F8D639AA77EDD3ACEFF07731C5E9C987','长安凯程-长安之星5','77','1','2020-09-11 11:20:07','20200911105258120.jpg','4'), ('89','F8D639AA77EDD3ACEFF07731C5E9C987','华晨鑫源-海狮X30L','76','1','2020-09-11 11:20:07','20200911105059941.jpg','5');
INSERT INTO `tbtype` VALUES ('1','轿车','/','0','轿车','0'), ('2','跑车','/','0','跑车','0'), ('3','越野车','/','0','越野车','0'), ('4','面包车','/','0','面包车','0'), ('31','微型车','轿车','1','轿车/微型车','1'), ('32','小型车','轿车','1','轿车/小型车','1'), ('33','中型车','轿车','1','轿车/中型车','1'), ('34','紧凑型车','轿车','1','轿车/紧凑型车','1'), ('35','大型车','轿车','1','轿车/大型车','1'), ('37','轿跑','跑车','2','跑车/轿跑','1'), ('38','双门跑车','跑车','2','跑车/双门跑车','1'), ('39','敞篷跑车','跑车','2','跑车/敞篷跑车','1');
INSERT INTO `tbuserhasrole` VALUES ('13','1',NULL,'1',NULL), ('14','12',NULL,'3',NULL), ('15','13',NULL,'4',NULL), ('16','13',NULL,'5',NULL);
INSERT INTO `tbusers` VALUES ('1','admin','123456','超级管理员','15397600038','四川成都总部',NULL,NULL), ('2','tangyan05','123456','张三','15397600036','上海江浦路店',NULL,NULL), ('7','feifei','123456','郭靖','15988886666','北京复兴门外大街10086号',NULL,NULL), ('8','tangyan03','123456','刘湘','15397600035','重庆来福士广场店',NULL,NULL), ('11','tangyan02','123456','汤燕','15397600033','成都经销商火车南站西路店',NULL,NULL), ('12','tangyan01','123456','汤燕','15397600032','成都天府广场店',NULL,NULL);
